# 2. Refine the Data
 
> "Data is messy"

We will be performing the following operation on our Onion price to refine it
- **Remove** e.g. remove redundant data from the data frame
- **Derive** e.g. State and City from the market field
- **Parse** e.g. extract date from year and month column

Other stuff you may need to do to refine are...
- **Missing** e.g. Check for missing or incomplete data
- **Quality** e.g. Check for duplicates, accuracy, unusual data
- **Convert** e.g. free text to coded value
- **Calculate** e.g. percentages, proportion
- **Merge** e.g. first and surname for full name
- **Aggregate** e.g. rollup by year, cluster by area
- **Filter** e.g. exclude based on location
- **Sample** e.g. extract a representative data
- **Summary** e.g. show summary stats like mean

In [114]:
# Import the two library we need, which is Pandas and Numpy
import pandas as pd
import numpy as np

In [115]:
# Read the csv file of Month Wise Market Arrival data that has been scraped.
df = pd.read_csv('MonthWiseMarketArrivals.csv')

In [116]:
df.head()

       market    month  year  quantity priceMin priceMax priceMod
0  ABOHAR(PB)  January  2005      2350      404      493      446
1  ABOHAR(PB)  January  2006       900      487      638      563
2  ABOHAR(PB)  January  2010       790     1283     1592     1460
3  ABOHAR(PB)  January  2011       245     3067     3750     3433
4  ABOHAR(PB)  January  2012      1035      523      686      605

In [117]:
df.tail()

          market     month   year   quantity  priceMin   priceMax  priceMod
10223  YEOLA(MS)  December   2012     207066       485       1327      1136
10224  YEOLA(MS)  December   2013     215883       472       1427      1177
10225  YEOLA(MS)  December   2014     201077       446       1654      1456
10226  YEOLA(MS)  December   2015     223315       609       1446      1126
10227        NaN       NaN  Total  783438108  647(Avg)  1213(Avg)  984(Avg)

## Remove the redundant data

In [118]:
df.dtypes

market      object
month       object
year        object
quantity     int64
priceMin    object
priceMax    object
priceMod    object
dtype: object

In [119]:
# Delete the last row from the dataframe
df.tail(1)

      market month   year   quantity  priceMin   priceMax  priceMod
10227    NaN   NaN  Total  783438108  647(Avg)  1213(Avg)  984(Avg)

In [120]:
# Delete a row from the dataframe
df.drop(df.tail(1).index, inplace = True)

In [121]:
df.head()

       market    month  year  quantity priceMin priceMax priceMod
0  ABOHAR(PB)  January  2005      2350      404      493      446
1  ABOHAR(PB)  January  2006       900      487      638      563
2  ABOHAR(PB)  January  2010       790     1283     1592     1460
3  ABOHAR(PB)  January  2011       245     3067     3750     3433
4  ABOHAR(PB)  January  2012      1035      523      686      605

In [122]:
df.tail()

          market     month  year  quantity priceMin priceMax priceMod
10222  YEOLA(MS)  December  2011    131326      282      612      526
10223  YEOLA(MS)  December  2012    207066      485     1327     1136
10224  YEOLA(MS)  December  2013    215883      472     1427     1177
10225  YEOLA(MS)  December  2014    201077      446     1654     1456
10226  YEOLA(MS)  December  2015    223315      609     1446     1126

In [123]:
df.dtypes

market      object
month       object
year        object
quantity     int64
priceMin    object
priceMax    object
priceMod    object
dtype: object

In [124]:
df.iloc[:,4:7].head()

  priceMin priceMax priceMod
0      404      493      446
1      487      638      563
2     1283     1592     1460
3     3067     3750     3433
4      523      686      605

In [125]:
df.iloc[:,2:7] = df.iloc[:,2:7].astype(int)

In [126]:
df.dtypes

market      object
month       object
year         int64
quantity     int64
priceMin     int64
priceMax     int64
priceMod     int64
dtype: object

In [127]:
df.head()

       market    month  year  quantity  priceMin  priceMax  priceMod
0  ABOHAR(PB)  January  2005      2350       404       493       446
1  ABOHAR(PB)  January  2006       900       487       638       563
2  ABOHAR(PB)  January  2010       790      1283      1592      1460
3  ABOHAR(PB)  January  2011       245      3067      3750      3433
4  ABOHAR(PB)  January  2012      1035       523       686       605

In [130]:
df.describe()

               year      quantity      priceMin      priceMax      priceMod
count  10227.000000  1.022700e+04  10227.000000  10227.000000  10227.000000
mean    2009.022294  7.660488e+04    646.944363   1212.760731    984.284345
std        4.372841  1.244087e+05    673.121850    979.658874    818.471498
min     1996.000000  2.000000e+01     16.000000    145.000000     80.000000
25%     2006.000000  8.898000e+03    209.000000    557.000000    448.000000
50%     2009.000000  2.746000e+04    440.000000    923.000000    747.000000
75%     2013.000000  8.835650e+04    828.000000   1527.000000   1248.000000
max     2016.000000  1.639032e+06   6000.000000   8192.000000   6400.000000

## Extracting the states from market names

In [131]:
df.market.value_counts().head()

LASALGAON(MS)     242
PIMPALGAON(MS)    224
MANMAD(MS)        218
LONAND(MS)        211
MAHUVA(GUJ)       210
Name: market, dtype: int64

In [132]:
df['state'] = df.market.str.split('(').str[-1]

In [133]:
df.head()

       market    month  year  quantity  priceMin  priceMax  priceMod state
0  ABOHAR(PB)  January  2005      2350       404       493       446   PB)
1  ABOHAR(PB)  January  2006       900       487       638       563   PB)
2  ABOHAR(PB)  January  2010       790      1283      1592      1460   PB)
3  ABOHAR(PB)  January  2011       245      3067      3750      3433   PB)
4  ABOHAR(PB)  January  2012      1035       523       686       605   PB)

In [134]:
df['city'] = df.market.str.split('(').str[0]

In [135]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city
0,ABOHAR(PB),January,2005,2350,404,493,446,PB),ABOHAR
1,ABOHAR(PB),January,2006,900,487,638,563,PB),ABOHAR
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB),ABOHAR
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB),ABOHAR
4,ABOHAR(PB),January,2012,1035,523,686,605,PB),ABOHAR

In [136]:
df.state.unique()

array(['PB)', 'UP)', 'GUJ)', 'MS)', 'RAJ)', 'BANGALORE', 'KNT)', 'BHOPAL',
       'OR)', 'BHR)', 'WB)', 'CHANDIGARH', 'CHENNAI', 'bellary)',
       'podisu)', 'UTT)', 'DELHI', 'MP)', 'TN)', 'Podis', 'GUWAHATI',
       'HYDERABAD', 'JAIPUR', 'WHITE)', 'JAMMU', 'HR)', 'KOLKATA', 'AP)',
       'LUCKNOW', 'MUMBAI', 'NAGPUR', 'KER)', 'PATNA', 'CHGARH)', 'JH)',
       'SHIMLA', 'SRINAGAR', 'TRIVENDRUM'], dtype=object)

In [137]:
df['state'] = df.state.str.split(')').str[0]

In [138]:
df.state.unique()

array(['PB', 'UP', 'GUJ', 'MS', 'RAJ', 'BANGALORE', 'KNT', 'BHOPAL', 'OR',
       'BHR', 'WB', 'CHANDIGARH', 'CHENNAI', 'bellary', 'podisu', 'UTT',
       'DELHI', 'MP', 'TN', 'Podis', 'GUWAHATI', 'HYDERABAD', 'JAIPUR',
       'WHITE', 'JAMMU', 'HR', 'KOLKATA', 'AP', 'LUCKNOW', 'MUMBAI',
       'NAGPUR', 'KER', 'PATNA', 'CHGARH', 'JH', 'SHIMLA', 'SRINAGAR',
       'TRIVENDRUM'], dtype=object)

In [139]:
dfState = df.groupby(['state', 'market'], as_index=False).count()

In [140]:
dfState.market.unique()

array(['KURNOOL(AP)', 'RAJAHMUNDRY(AP)', 'BANGALORE', 'BHOPAL',
       'BIHARSHARIF(BHR)', 'CHANDIGARH', 'CHENNAI', 'RAIPUR(CHGARH)',
       'DELHI', 'AHMEDABAD(GUJ)', 'BHAVNAGAR(GUJ)', 'DEESA(GUJ)',
       'GONDAL(GUJ)', 'JAMNAGAR(GUJ)', 'MAHUVA(GUJ)', 'RAJKOT(GUJ)',
       'SURAT(GUJ)', 'GUWAHATI', 'KARNAL(HR)', 'HYDERABAD', 'JAIPUR',
       'JAMMU', 'RANCHI(JH)', 'PALAYAM(KER)', 'BELGAUM(KNT)',
       'BIJAPUR(KNT)', 'CHALLAKERE(KNT)', 'CHICKBALLAPUR(KNT)',
       'DHAVANGERE(KNT)', 'HASSAN(KNT)', 'HUBLI(KNT)', 'KOLAR(KNT)',
       'RAICHUR(KNT)', 'KOLKATA', 'LUCKNOW', 'DEWAS(MP)', 'INDORE(MP)',
       'MANDSOUR(MP)', 'NEEMUCH(MP)', 'SAGAR(MP)', 'UJJAIN(MP)',
       'AHMEDNAGAR(MS)', 'BOMBORI(MS)', 'CHAKAN(MS)', 'CHANDVAD(MS)',
       'DEVALA(MS)', 'DHULIA(MS)', 'DINDORI(MS)', 'JALGAON(MS)',
       'JUNNAR(MS)', 'KALVAN(MS)', 'KOLHAPUR(MS)', 'KOPERGAON(MS)',
       'LASALGAON(MS)', 'LONAND(MS)', 'MALEGAON(MS)', 'MANMAD(MS)',
       'NANDGAON(MS)', 'NASIK(MS)', 'NEWASA(MS)', 'NIPHAD(MS)',
       'PHALTAN (MS)', 'PIMPALGAON(MS)', 'PUNE(MS)', 'RAHATA(MS)',
       'RAHURI(MS)', 'SAIKHEDA(MS)', 'SANGALI(MS)', 'SANGAMNER(MS)',
       'SATANA(MS)', 'SHRIRAMPUR(MS)', 'SINNAR(MS)', 'SOLAPUR(MS)',
       'SRIRAMPUR(MS)', 'VANI(MS)', 'YEOLA(MS)', 'MUMBAI', 'NAGPUR',
       'BHUBNESWER(OR)', 'PATNA', 'ABOHAR(PB)', 'AMRITSAR(PB)',
       'BHATINDA(PB)', 'HOSHIARPUR(PB)', 'JALANDHAR(PB)', 'KHANNA(PB)',
       'LUDHIANA(PB)', 'PATIALA(PB)', 'DINDIGUL(TN)(Podis', 'AJMER(RAJ)',
       'ALWAR(RAJ)', 'BIKANER(RAJ)', 'JODHPUR(RAJ)', 'KOTA(RAJ)',
       'SRIGANGANAGAR(RAJ)', 'UDAIPUR(RAJ)', 'SHIMLA', 'SRINAGAR',
       'DINDIGUL(TN)', 'MADURAI(TN)', 'TRIVENDRUM', 'AGRA(UP)',
       'ALIGARH(UP)', 'BALLIA(UP)', 'BAREILLY(UP)', 'DEORIA(UP)',
       'ETAWAH(UP)', 'GORAKHPUR(UP)', 'KANPUR(UP)', 'MEERUT(UP)',
       'VARANASI(UP)', 'DEHRADOON(UTT)', 'HALDWANI(UTT)', 'BURDWAN(WB)',
       'MIDNAPUR(WB)', 'PURULIA(WB)', 'SHEROAPHULY(WB)', 'JALGAON(WHITE)',
       'COIMBATORE(TN) (bellary)', 'COIMBATORE(TN) (podisu)'],
      dtype=object)

In [141]:
state_now = ['PB', 'UP', 'GUJ', 'MS', 'RAJ', 'BANGALORE', 'KNT', 'BHOPAL', 'OR',
       'BHR', 'WB', 'CHANDIGARH', 'CHENNAI', 'bellary', 'podisu', 'UTT',
       'DELHI', 'MP', 'TN', 'Podis', 'GUWAHATI', 'HYDERABAD', 'JAIPUR',
       'WHITE', 'JAMMU', 'HR', 'KOLKATA', 'AP', 'LUCKNOW', 'MUMBAI',
       'NAGPUR', 'KER', 'PATNA', 'CHGARH', 'JH', 'SHIMLA', 'SRINAGAR',
       'TRIVENDRUM']

In [142]:
state_new =['PB', 'UP', 'GUJ', 'MS', 'RAJ', 'KNT', 'KNT', 'MP', 'OR',
       'BHR', 'WB', 'CH', 'TN', 'KNT', 'TN', 'UP',
       'DEL', 'MP', 'TN', 'TN', 'ASM', 'AP', 'RAJ',
       'MS', 'JK', 'HR', 'WB', 'AP', 'UP', 'MS',
       'MS', 'KER', 'BHR', 'HR', 'JH', 'HP', 'JK',
       'KEL']

In [143]:
df.state = df.state.replace(state_now, state_new)

In [144]:
df.state.unique()

array(['PB', 'UP', 'GUJ', 'MS', 'RAJ', 'KNT', 'MP', 'OR', 'BHR', 'WB',
       'CH', 'TN', 'DEL', 'ASM', 'AP', 'JK', 'HR', 'KER', 'JH', 'HP',
       'KEL'], dtype=object)

## Getting the Dates

In [145]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR

In [146]:
df.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            10217, 10218, 10219, 10220, 10221, 10222, 10223, 10224, 10225,
            10226],
           dtype='int64', length=10227)

In [147]:
pd.to_datetime('January 2012')

Timestamp('2012-01-01 00:00:00')

In [148]:
df['date'] = df['month'] + '-' + df['year'].map(str)

In [149]:
??map

In [113]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,January-2005
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,January-2006
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,January-2010
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,January-2011
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,January-2012

In [150]:
index = pd.to_datetime(df.date)
print(df.dtypes)
df['date'] = df.date.astype(str)
df.dtypes

market      object
month       object
year         int64
quantity     int64
priceMin     int64
priceMax     int64
priceMod     int64
state       object
city        object
date        object
dtype: object

market      object
month       object
year         int64
quantity     int64
priceMin     int64
priceMax     int64
priceMod     int64
state       object
city        object
date        object
dtype: object

In [109]:
df.index = pd.PeriodIndex(df.date, freq='M')

TypeError: Incorrect dtype

In [ ]:
df.columns

In [87]:
df.index

PeriodIndex(['2005-01', '2006-01', '2010-01', '2011-01', '2012-01', '2013-01',
             '2014-01', '2015-01', '2005-02', '2006-02',
             ...
             '2006-12', '2007-12', '2008-12', '2009-12', '2010-12', '2011-12',
             '2012-12', '2013-12', '2014-12', '2015-12'],
            dtype='int64', length=10227, freq='M')

In [88]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
2005-01,ABOHAR(PB),Jan,2005,2350,404,493,446,PB,ABOHAR,Jan-2005
2006-01,ABOHAR(PB),Jan,2006,900,487,638,563,PB,ABOHAR,Jan-2006
2010-01,ABOHAR(PB),Jan,2010,790,1283,1592,1460,PB,ABOHAR,Jan-2010
2011-01,ABOHAR(PB),Jan,2011,245,3067,3750,3433,PB,ABOHAR,Jan-2011
2012-01,ABOHAR(PB),Jan,2012,1035,523,686,605,PB,ABOHAR,Jan-2012

In [ ]:
df.to_csv('MonthWiseMarketArrivals_Clean.csv', index = False)